Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/social_welfare_payments_and_work/back_to_work_enterprise_allowance.html.txt.tmx
Source language: en
Languages: ga

source: Back to Work Enterprise Allowance
ga: Liúntas Fiontraíochta um Fhilleadh ar Obair

source: The Back to Work Enterprise Allowance (BTWEA) scheme encourages people getting certain social welfare payments to become self-employed
ga: Spreagann an scéim Liúntas Fiontraíochta um Fhilleadh ar Obair daoine atá ag fáil íocaíochtaí leasa shóisialta áirithe dul i mbun féinfhostaíochta

source: If you take part in the Back to Work Enterprise Allowance scheme you can keep a percentage of your social welfare payment for up to 2 years
ga: Coinníonn daoine atá ag glacadh páirte sa scéim Liúntas Fiontraíochta um Fhilleadh ar Obair ceatadán dá n-íocaíochtaí leasa shóisialta ar feadh 2 bliana

source: A Back to Work Scheme called the Short-Term Enterprise Allowance started in May 2009
ga: Cuireadh tús i mBealtaine 2009 le scéim nua Liúntas um Fhilleadh ar an Obair dá ngairtear an Liúntas Fiontraíochta Gearrthréimhseach

source: There is no qualifying period for the Short-Term Enterprise Allowance
ga: Níl aon tréimhse cháilitheach chun Liúntas Fiontraíochta Gearrthréimhseach a fháil

source: You can get immediate access to the allowance if you meet the qualifying conditions
ga: Is féidir rochtain láithreach ar an liúntas a fháil ach caithfidh tú na coinníollacha cáilithe a shásamh

source: The Back to Work Enterprise Allowance is payable to people aged under 66
ga: Is féidir an Liúntas Fiontraíochta um Fhilleadh ar Obair a íoc le daoine atá faoi aois 66

source: You can qualify for a Back to Work Enterprise Allowance (BTWEA) if you are:
ga: Is féidir leat cáiliú le haghaidh Liúnta Fiontraíochta um Fhilleadh ar Obair (BTWEA) má:

source: Setting up as self-employed in a business that has been approved in advance in writing by a DSP Case Officer or Local Development Company (LDC) (see 'How to apply' below)
ga: Tá tú ag tosú mar ghnólacht féinfhostaithe a ceadaíodh i scríbhinn roimh ré ag Oifigeach Cáis nó ag Comhlacht Comhpháirtíochta (féach ‘Conas iarratas a dhéanamh’ thíos)

source: Getting one of the qualifying payments listed below for at least 9 months (234 days)
ga: Tá Liúntas Cuardaitheora Poist nó Sochar Cuardaitheora Poist (le bunteidlíocht i leith an Liúntais Chuardaitheora Poist)* á fháil agat ar feadh 9 mí ar a laghad, nó tá ceann de na híocaíochtaí cáilithíocha a liostaítear thíos á fáil agat ar feadh 12 mhí ar a laghad

source: • Jobseeker's Allowance (JA) • Jobseeker's Benefit (with an underlying entitlement to Jobseeker's Allowance)*
ga: • Socrú idirthréimhseach Liúntas Cuardaitheora Poist

source: • Carer's Allowance (having stopped caring duties)
ga: • Liúntas Cúramóra (tar éis deireadh a chur leis na dualgais chúraim)

source: • Widow's/Widower's or Surviving Civil Partner's (Non-Contributory) Pension or
ga: • Sochar nó Liúntas Banchéile Tréigthe

source: • Combination of OFP/JST/JA for 9 months (234 days)
ga: • Sochar Breoiteachta ar feadh 3 bliana nó níos faide

source: *Having an underlying entitlement to Jobseeker's Allowance means that you would pass the means test and other criteria
ga: *Má tá Sochar Cuardaitheora Poist á fháil agat, ní mór duit bheith dífhostaithe ar feadh 2 bhliain le bheith incháilithe

source: Signing on for unemployment credits following your Jobseeker's Benefit does not count towards the qualifying period
ga: Ní chuirtear san áireamh síniú le haghaidh creidmheasanna dhífhostaíochta i ndiaidh do Shochair Chuardaitheora Poist i dtreo na tréimhse cáilithe

source: You may also be considered for the BTWEA if you are:
ga: Ina theannta sin, d’fhéadfaí breithniú a dhéanamh ort don Liúntas Fiontraíochta um Fhilleadh ar Obair má:

source: • A dependent adult of a person who is in receipt of the BTWEA
ga: Féadfaidh teidlíocht a bheith aige/aici faoin scéim go ceann na tréimhse a bheidh fágtha ar an éileamh bunaidh

source: You may qualify if the person taking part in the BTWEA scheme stops their self-employment before exhausting their entitlement. The spouse or partner may avail of the scheme for the time remaining on the original claim
ga: Is éard atá i gceist anseo ná go n-aistríonn an duine atá intofa don Liúntas Fiontraíochta um Fhilleadh ar Obair a t(h)eidlíochtaí chuig a c(h)éile, a p(h)áirtnéir sibhialta nó a c(h)omhchónaitheoir

source: This involves the person who is eligible for the BTWEA transferring his or her entitlements to their spouse, civil partner or cohabitant
ga: (I bhfocail eile, téann an céile, an páirtnéir sibhialta nó an comhchónaitheoir le féinfhostaíocht agus is é an t-éilitheoir bunaidh an duine fásta cáilithe ar an Liúntas Fiontraíochta um Fhilleadh ar Obair)

source: (In other words, the spouse, civil partner or cohabitant becomes self-employed and the original claimant becomes the qualified adult on the BTWEA)
ga: Má tá an t-éilitheoir bunaidh i dteideal creidmheasanna, is féidir leis/léi leanúint de chreidmheasanna a éileamh

source: If the original claimant is entitled to credits, he or she can continue to claim them
ga: Ní féidir, áfach, an Liúntas Fiontraíochta um

source: However BTWEA cannot be paid at the same time as another social welfare payment so if the original claimant (now a qualified adult) decides to claim another payment you must stop claiming BTWEA
ga: Fhilleadh ar Obair a íoc in éineacht le híocaíocht leasa shóisialaigh eile agus mar sin, má chinneann an t-éilitheoir bunaidh (arb é an duine fásta cáilithe anois é) ar íocaíocht eile a éileamh, ní mór duit éirí as an Liúntas Fiontraíochta um Fhilleadh ar Obair a éileamh

source: • A person released from prison who satisfies the eligibility criteria for the scheme
ga: • Duine atá ionat a scaoileadh ón bpríosún a shásaíonn na critéir incháilitheachta le haghaidh na scéime

source: Periods of time spent on full-time FET, Fáilte Ireland and Teagasc training courses, Community Employment, Social Economy Programme, Rural Social Scheme, FIT, Job Initiative, JobBridge, Work Placement Programme, Tús, BTEA and VTOS schemes are accepted as qualifying periods provided you were entitled to a qualifying payment before starting on the study or training
ga: Is féidir tréimhse ar bith caite ar chúrsaí traenála FET, Scéimeanna Fostaíochta Pobail , Clár Seirbhísí Pobail, Scéím Tionscnamh Jabanna, Fáilte Ireland, TEAGASC, FIT, JobBridge, Scéim Náisiúnta Intéirneachta, agus scéimeanna um Fhilleadh ar Oideachas a chur san áireamh mar thréimsí dífhostaithe

source: Time spent on Supplementary Welfare Allowance or in direct provision can count towards the qualifying period for BTWEA as long as you establish an entitlement to a relevant payment before starting the BTWEA
ga: Áirítear tréimhsí ina bhfuarthas Liúntas Leasa Forlíontach agus Soláthar Díreach i leith na tréimhse cáiliúcháin ar choinníoll go mbunaíonn an t-iarratasóir teidlíocht ar íocaíocht ábhartha Leasa Shóisialaigh roimh dó/di an scéim a thosú

source: If you have previously participated in the BTWEA scheme and used up your entitlement, you can participate a second time after at least 5 years
ga: Má ghlac tú páirt cheana i scéim LFFO agus má tá do theideal ídithe agat, féadfaidh tú páirt a ghlacadh an athuair má tá 5 bliana ar a laghad imithe ó shin

source: Find out more about the qualifying periods for Back to Work Enterprise Allowance
ga: Tá tuilleadh eolais ar fáil maidir le tréimhsí cáiliúcháin um Liúntas Fiontraíochta um Fhilleadh ar Obair

source: Help starting a business
ga: Cabhair le gnó a thosú

source: You must be able to make a matching contribution of at least 20% to access grant support
ga: Is féidir leat tuilleadh faisnéise a fháil faoi éirí féinfhostaithe

source: │Short-term training on book-keeping, regulation, rollout of business plan, start-your-own-business and courses of training related to the start-up │Up to €250 │20% │
ga: Ní rachaidh deontais fostaíochta ó Oifigí Fiontair Áitiúla nó ó nó ó chuideachtaí LDC i gcion ar do theidlíocht maidir leis an Liúntas Fiontraíochta um Fhilleadh ar an Obair nó leis an Liúntas Fiontraíochta Gearrthéarmach

source: • Training or education other than that specified
ga: Liúntas Fiontraíochta um Fhilleadh ar Obair

source: If you qualify for the Back to Work Enterprise Allowance you can keep the following portion of your social welfare payment, including increases for a qualified adult and qualified children, for a maximum of 2 years:
ga: Coinneoidh rannpháirtithe nua na céatadáin seo a leanas dá n-íocaíocht leasa shóisialaigh, lena n-áirítear méaduithe do dhuine fásta cáilithe agus do leanaí cáilithe, go ceann 2 bhliain ar a mhéid:

source: You can keep your extra (or secondary benefits) for as long as you are getting the Back to Work Enterprise Allowance
ga: Coinneoidh tú aon sochair tánaisteacha chomh fada is atá tú ag fáil an Liúntas Fiontraíochta um Fhilleadh ar Obair nó an Liúntas Fiontraíochta Gearrthréimhseach

source: Your Rent Supplement may be affected if your earnings go up while you are on the scheme. You should check with the Department of Social Protection's representative (formerly known as the Community Welfare Officer) in your local health centre to see how your Rent Supplement may be affected by your participation in the Back to Work Enterprise Allowance
ga: Ba chóir duit ceist a chur ar d’Oifigeach Leasa Pobail i d’ionad Sláinte áitiúil chun a fháil amach cén tionchar a d’fhéadfadh a bheith ag do rannpháirtíocht sa Liúntas Fiontraíochta um Fhilleadh ar Obair nó sa Liúntas Fiontraíochta Gearrthréimhseach ar do Fhorlíonadh Cíosa

source: • Back to School Clothing and Footwear Allowance
ga: • Fordheontas Aiste Bia • Liúntas Éadaí agus Coisbhirt don Scoilbhliain Nua

source: • Differential rents (from your local authority)
ga: • Cíosanna Difreálacha (ó d’údarás áitiúil)

source: The Back to Work Enterprise Allowance is paid directly into your bank or building society account each week
ga: Íocfar an Liúntas Fiontraíochta um Fhilleadh ar Obair díreach isteach i do chuntas bainc nó do chuntas cumainn foirgníochta ar bhunús seachtainiúil

source: The allowance cannot be paid into a mortgage account
ga: Ní féidir an liúntas a íoc isteach i gcuntas morgáiste

source: You do not have to pay tax, PRSI or Universal Social Charge on the Back to Work Enterprise Allowance but you may have to pay tax, PRSI and Universal Social Charge on any income you get from self-employment
ga: Ní mór duit dul i dteagmháil leis an Roinn Coimirce Sóisialaí láithreach má thagann deireadh le do fhéinfhostaíocht nó má ghlacann tú le fostaíocht

source: It runs from 23 October 2013 to 31 December 2018
ga: Conas iarratas a dhéanamh

source: To apply for the Back to Work Enterprise Allowance, complete application form BTW 2
ga: Líonfoirm iarratais BTW 2 (pdf) chun iarratas a dhéanamh ar an Liúntas Fiontraíochta um Fhilleadh ar Obair

source: If you live in an area covered by a Local Development Company (LDC) (sometimes known as local partnership companies) you should return form BTW 2 to the Enterprise Officer in the LDC
ga: Má tá tú i do chónaí i gceantar Comhpháirtíochta nó i gceantar Cuideachta Forbartha Áitiúla Comhtháite (CFAC), ba cheart duit an fhoirm BTW 2 a chur ar ais chuig i do Chomhphairtíocht nó CFAC chun go gcuirfear í faoi bhráid Oifigeach Fiontair

source: If you do not live in a LDC Area, you should return form BTW 2 to the Case Officer in your Intreo Centre or Social Welfare Branch Office
ga: Má tá tú i do chónaí i gceantar nach ceantar comhphairtíochta ná CFAC é, ba cheart duit foirm BTW 2 a chur chuig d'oifigeach leasa shóisialaigh áitiúil chun go gcuirfear í faoi bhráid Oifigeach Cáis

source: You must not take up self-employment until you have received written approval from the LDC or Department of Social Protection
ga: Breathnóidh an Oifigeach Fiontair nó Oifigeach Cáis ar do thogra gnó agus b'fhéidir go pléifidh sé/sí gnéithe áirithe de leat

source: If you are accepted on to the Back to Work Enterprise Allowance, you must register as self-employed with the Revenue Commissioners
ga: Ní cead agat féinfhostaíocht a thosnú go dtí go bhfuil faomhadh scríofa faighte agat dó ón gComhlacht Comhphairtíochta/CFAC nó an Roinn Coimirce Sóisialaí

source: However you can ask the Department of Social Protection to review your application if you feel that you have been wrongly refused the allowance
ga: Má ghlactar leat ar an scéim um Fhilleadh ar Obair Fiontar, ní foláir duit clarú mar dhuine féinfhostaithe leis na Coimisinéirí Ioncaim

source: If you live in an area covered by a Local Development Company (LDC) (pdf), you should apply to the Enterprise Officer in your local ILDC
ga: Má tá tú i do chónaí i gceantar Comhpháirtíochta nó i gceantar Cuideachta Forbartha Áitiúla Comhtháite (CFAC) (pdf), ba cheart duit iarratas a dhéanamh ar an Oifigeach Fiontair i do Chomhphairtíocht nó CFAC

source: If you do not live in a LDC area, you should apply to the Case Officer in your Intreo Centre or Social Welfare Branch Office
ga: Má tá tú i do chónaí i gceantar nach ceantar comhphairtíochta ná CFAC é, ba cheart duit iarratas a dhéanamh ar anOifigeach Cáis i d'oifig Intreo ó leasa shóisialaigh áitiúil
